xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_lcd.c
/******************************************************************************
 * @file     nano1xx_lcd.c
 * @brief    NANO1xx LCD driver source file.
 *			 The LCD driver can directly drives a LCD glass by creating the ac
 *           segment and common voltage signals automatically. It can support 
 *           static, 1/2 duty, 1/3 duty and 1/4 duty LCD glass with up to 38 
 *           segments with 6 COM or 40 segments with 4 COM.
 * @version  1.0.2
 * @date     26, October, 2012
 *
 * @note
 * Copyright (C) 2012-2014 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include "nano1xx.h"
#include "nano1xx_lcd.h"
#include "nano1xx_assert.h"


/** @addtogroup NANO1xx_Device_Driver NANO1xx Device Driver
  @{
*/

/** @addtogroup NANO1xx_LCD_Driver LCD Driver
  @{
*/

/// @cond
#ifdef __LCDDISPLAY_PD_878_H
#include "nano1xx_lcd_pd_878.h"
#endif
#ifdef __LCDDISPLAY_GFN616A_H
#include "nano1xx_lcd_gfn616a.h"
#endif
#ifdef __LCDDISPLAY_BTL001_H
#include "nano1xx_lcd_btl001.h"
#endif
#ifdef __LCDDISPLAY_BTL001_LB_H
#include "nano1xx_lcd_btl001_lb.h"
#endif


//#define LCD_DEBUG
#ifdef LCD_DEBUG
#define LCDDEBUG     printf
#else
#define LCDDEBUG(...)
#endif

/// @endcond


/** @addtogroup NANO1xx_LCD_EXPORTED_CONSTANTS LCD Exported Constants
  @{
*/
#define LCD_FCR_FCV_BIT_ADDR	4

#define LCD_CTL_FREQ_BIT_ADDR	4
#define LCD_CTL_MUX_BIT_ADDR	1

/*@}*/ /* end of group NANO1xx_LCD_EXPORTED_CONSTANTS */


/** @addtogroup NANO1xx_LCD_EXPORTED_VARIABLES LCD Exported Variables
  @{
*/
/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/

uint32_t g_LCDClkSrc = 32768;	// in default, clock source from 32K
double g_LCDFreq;
double g_LCDFrameRate;	/* src:32768Hz, COM:4, FREQ Div:64, frame-rate 64Hz  */
								/* src:10240Hz, COM:4, FREQ Div:32, frame-rate 40Hz  */
double g_ChargePumpFreq;					/* (Hz) */								
double g_LCDFrameCountFreq;			/* (Hz) */
double g_LCDFrameCountINTFreq;		/* indicate the frequency of frame count interrupt (Hz) */

/*@}*/ /* end of group NANO1xx_LCD_EXPORTED_VARIABLES */


/** @addtogroup NANO1xx_LCD_EXPORTED_FUNCTIONS LCD Exported Functions
  @{
*/

/**
 *  @brief Enables a segment on the LCD display
 *
 *  @param[in] com      COM segment number
 *  @param[in] bitvalue Bit number for segment 
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  // turn on COM3-SEG10 dot
 *  LCD_EnableSegment ( 3, 10 );
 *  @endcode
 *
 */
void LCD_EnableSegment(int com, int bitvalue)
{
	int32_t memnum = bitvalue / 4;
	int32_t seg_shift = 8*(bitvalue-(4*memnum));

	if(memnum==0)
	{
		LCD->MEM_0 |= (1<<com)<<seg_shift;
	}
	else if(memnum==1)
	{
		LCD->MEM_1 |= (1<<com)<<seg_shift;
	}
	else if(memnum==2)
	{
		LCD->MEM_2 |= (1<<com)<<seg_shift;
	}
	else if(memnum==3)
	{
		LCD->MEM_3 |= (1<<com)<<seg_shift;
	}
	else if(memnum==4)
	{
		LCD->MEM_4 |= (1<<com)<<seg_shift;
	}
	else if(memnum==5)
	{
		LCD->MEM_5 |= (1<<com)<<seg_shift;
	}
	else if(memnum==6)
	{
		LCD->MEM_6 |= (1<<com)<<seg_shift;
	}
	else if(memnum==7)
	{
		LCD->MEM_7 |= (1<<com)<<seg_shift;
	}
	else if(memnum==8)
	{
		LCD->MEM_8 |= (1<<com)<<seg_shift;
	}
	else if(memnum==9)
	{
		LCD->MEM_9 |= (1<<com)<<seg_shift;
	}
}

/**
 *  @brief Disables a segment on the LCD Display
 *
 *  @param[in] com      COM segment number
 *  @param[in] bitvalue Bit number for segment 
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  // turn off COM3-SEG10 dot
 *  LCD_DisableSegment ( 3, 10 );
 *  @endcode
 *
 */
void LCD_DisableSegment(int com, int bitvalue)
{
	int32_t memnum = bitvalue / 4;
	int32_t seg_shift = 8*(bitvalue-(4*memnum));

	if(memnum==0)
	{
		LCD->MEM_0 &= ~((1<<com)<<seg_shift);
	}
	else if(memnum==1)
	{
		LCD->MEM_1 &= ~((1<<com)<<seg_shift);
	}
	else if(memnum==2)
	{
		LCD->MEM_2 &= ~((1<<com)<<seg_shift);
	}
	else if(memnum==3)
	{
		LCD->MEM_3 &= ~((1<<com)<<seg_shift);
	}
	else if(memnum==4)
	{
		LCD->MEM_4 &= ~((1<<com)<<seg_shift);
	}
	else if(memnum==5)
	{
		LCD->MEM_5 &= ~((1<<com)<<seg_shift);
	}
	else if(memnum==6)
	{
		LCD->MEM_6 &= ~((1<<com)<<seg_shift);
	}
	else if(memnum==7)
	{
		LCD->MEM_7 &= ~((1<<com)<<seg_shift);
	}
	else if(memnum==8)
	{
		LCD->MEM_8 &= ~((1<<com)<<seg_shift);
	}
	else if(memnum==9)
	{
		LCD->MEM_9 &= ~((1<<com)<<seg_shift);
	}
}


/**
 *  @brief Write number on numeric part on LCD display
 *
 *  @param[in] value \n	 
 *                   Numeric value to put on display, in range -9999999 to +99999999 (LQFP64 package) \n
 *	                And in range -999999999 to +9999999999 (LQFP100 package)
 *
 *  @par Include:
 * 	  nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  // show 99999999 number
 *  LCD_Number ( 99999999 );
 *  @endcode
 *
 */
void LCD_Number(long long value)
{
	long long num, i, com, bit, digit, div, neg, len, tmp;
  	uint16_t bitpattern;

  	/* Parameter consistancy check */
#ifdef __LCDDISPLAY_PD_878_H	
#ifdef LCD_LQFP100_PIN	
  	if (value >= 9999999999)
#elif defined(LCD_LQFP64_PIN)
  	if (value >= 99999999)
#endif
  	{
#ifdef LCD_LQFP100_PIN  	
    	value = 9999999999;
#elif defined(LCD_LQFP64_PIN)
		value = 99999999;
#endif
  	}
#ifdef LCD_LQFP100_PIN 
  	if (value <= -1000000000)
#elif defined(LCD_LQFP64_PIN)
  	if (value <= -10000000)
#endif
  	{
#ifdef LCD_LQFP100_PIN   	
    	value = -999999999;
#elif defined(LCD_LQFP64_PIN)
    	value = -9999999;
#endif
  	}
#endif

#ifdef __LCDDISPLAY_GFN616A_H
#ifdef LCD_LQFP100_PIN	
  	if (value >= 9999999999999)
  	{	
    	value = 9999999999999;
  	}
#endif	
#ifdef LCD_LQFP100_PIN 
  	if (value <= -1000000000000)
  	{
    	value = -999999999999;
  	}
#endif
#endif

