xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_lcd.c
  	if (value < 0)
  	{
    	value = abs(value);
    	neg   = 1;
  	}
  	else
  	{
    	neg = 0;
  	}

  	/* Turn off all number LCD segments */
  	LCD_NumberOff();

	/* Length of number */
	len = 0;
	tmp = value;
	while( 1 )
	{
		if( (tmp/10) || (tmp%10) )
		{
			tmp = tmp / 10;
			len++;
		}
		else break;
	}

  	/* Extract useful digits */
  	div = 1;
  	//for (digit = 0; digit < LCD_DIGIT_NUM; digit++)
  	for (digit = (LCD_DIGIT_NUM-1); digit >= 0; digit--)
  	{
    	num = (value / div) % 10;
    	if ((neg == 1) && (digit == (LCD_DIGIT_NUM-1-len))) num = 10;
    	bitpattern = Nuvo_Numbers[num];
    	for (i = 0; i < LCD_DIGIT_SEGNUM; i++)
    	{
      		bit = NANO1XXDISPLAY.Number[digit].bit[i];
      		com = NANO1XXDISPLAY.Number[digit].com[i];
      		if (bitpattern & (1 << i))
      		{
        		LCD_EnableSegment(com, bit);
      		}
    	}
    	div = div * 10;
  	}

}


/**
 *  @brief Turn all segments on numeric display off
 *
 *  @param None
 *
 *  @par Include:
 * 	  nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_NumberOff();
 *  @endcode
 *
 */
void LCD_NumberOff(void)
{
  	/* Turn off all number segments */
#ifdef __LCDDISPLAY_PD_878_H	
  	LCD->MEM_0 &= 0x00000000;
  	LCD->MEM_1 &= 0x00000000;
  	LCD->MEM_2 &= 0x00000000;
  	LCD->MEM_3 &= 0x00000000;
	LCD->MEM_4 &= 0x00000000;
	LCD->MEM_5 &= 0x00000000;
	LCD->MEM_6 &= 0x00000000;
	LCD->MEM_7 &= 0x00000000;
	LCD->MEM_8 &= 0x00000000;
	LCD->MEM_9 &= 0x00000000;
#endif	
#ifdef __LCDDISPLAY_GFN616A_H
	LCD->MEM_0 &= ~0x0f000000;
  	LCD->MEM_1 &= ~0x0f0f0f0f;
  	LCD->MEM_2 &= ~0x000f0f0f;
	LCD->MEM_5 &= ~0x0f0e0000;
	LCD->MEM_6 &= ~0x0f0f0f0f;
	LCD->MEM_7 &= ~0x0f0f0f0f;
	LCD->MEM_8 &= ~0x0f0f0f0f;
	LCD->MEM_9 &= ~0x070f0f0f;
#endif
#ifdef __LCDDISPLAY_BTL001_H
	#ifdef __NANO100A__
	LCD->MEM_0 &= ~0x0f0f0f0f;
  	LCD->MEM_1 &= ~0x0f0f0f0f;
  	LCD->MEM_2 &= ~0x0f0f0f0f;
  	LCD->MEM_3 &= ~0x0f0f0f0f;
	LCD->MEM_4 &= ~0x0f0f0f0f;
	LCD->MEM_5 &= ~0x0f070f0f;
	LCD->MEM_6 &= ~0x0f0f0f0f;
	LCD->MEM_7 &= ~0x0f0f0f0f;
	LCD->MEM_8 &= ~0x00000f0f;
	#else
	LCD->MEM_6 &= ~0x0f0f0000;
	LCD->MEM_7 &= ~0x0f0f0f0f;
	LCD->MEM_8 &= ~0x00000f0f;
	#endif
#endif
#ifdef __LCDDISPLAY_BTL001_LB_H
	LCD->MEM_0 &= ~0x0f0f0f0f;
#endif
  	return;
}

/**
 *  @brief Turn all segments on alphanumeric display off
 *
 *  @param None
 *
 *  @par Include:
 * 	  nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_AlphaNumberOff();
 *  @endcode
 *
 */
void LCD_AlphaNumberOff(void)
{
  	/* Turn off all number segments */
#ifdef __LCDDISPLAY_PD_878_H	
  	LCD->MEM_0 &= 0x00000000;
  	LCD->MEM_1 &= 0x00000000;
  	LCD->MEM_2 &= 0x00000000;
  	LCD->MEM_3 &= 0x00000000;
	LCD->MEM_4 &= 0x00000000;
	LCD->MEM_5 &= 0x00000000;
	LCD->MEM_6 &= 0x00000000;
	LCD->MEM_7 &= 0x00000000;
	LCD->MEM_8 &= 0x00000000;
	LCD->MEM_9 &= 0x00000000;
#endif
#ifdef __LCDDISPLAY_BTL001_H
	#ifdef __NANO100A__
	LCD->MEM_0 &= ~0x0f0f0f0f;
  	LCD->MEM_1 &= ~0x0f0f0f0f;
  	LCD->MEM_2 &= ~0x0f0f0f0f;
  	LCD->MEM_3 &= ~0x0f0f0f0f;
	LCD->MEM_4 &= ~0x0f0f0f0f;
	LCD->MEM_5 &= ~0x0f070f0f;
	LCD->MEM_6 &= ~0x00000f0f;
	#else
	LCD->MEM_0 &= ~0x0f0f0f0f;
  	LCD->MEM_1 &= ~0x0f0f0f0f; 
  	LCD->MEM_2 &= ~0x0f0f0f0f; 
  	LCD->MEM_3 &= ~0x0f0f0f0f;
	LCD->MEM_4 &= ~0x0f0f0f0f; 
	LCD->MEM_5 &= ~0x0f070f0f;
	LCD->MEM_6 &= ~0x00000f0f;
	LCD->MEM_9 &= ~0x0f060000;
	#endif
#endif
#ifdef __LCDDISPLAY_BTL001_LB_H
  	LCD->MEM_2 &= ~0x0f0f0f0f;
  	LCD->MEM_3 &= ~0x0f0f0000;
	LCD->MEM_4 &= ~0x0f0f0f0f;
	LCD->MEM_5 &= ~0x0f0f0000;
	LCD->MEM_6 &= ~0x00000f0f;
	LCD->MEM_8 &= ~0x00000f0f;
#endif
  	return;
}

/**
 *  @brief Write text on LCD display
 *
 *  @param[in] string  Text string to show on display  
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  // show the Nuvoton text on LCD
 *  LCD_Write ( "Nuvoton" );
 *  @endcode
 *
 */
void LCD_Write(char *string)
{
	int      data, length, index;
	uint16_t bitfield;
	//uint32_t value;
	uint32_t com, bit;
	int      i;

	length = strlen(string);
	index  = 0;


	/* Turn all segments off */
	LCD_AlphaNumberOff();

	/* fill out all characters on display */
	for (index = 0; index < LCD_ALPHABET_NUM; index++)
	{
    	if (index < length)
    	{
      		data = (int) *string;
    	}
    	else           /* padding with space */
    	{
      		data = 0x20; /* SPACE */
    	}
    	/* defined letters currently starts at "SPACE" - 0x20; */
    	data     = data - 0x20;
    	bitfield = Nuvo_alphabet[data];


    	for (i = 0; i < LCD_ALPHABET_SEGNUM; i++)
    	{
      		bit   = NANO1XXDISPLAY.Text[index].bit[i];
      		com   = NANO1XXDISPLAY.Text[index].com[i];
      		//value = (1 << bit);

      		if (bitfield & (1 << i))
      		{
        		/* Turn on segment */
        		LCD_EnableSegment(com, bit);
      		}
    	}
    	string++;
	}

}

/**
 *  @brief LCD Disable all segments
 *
 *  @param None
 *
 *  @par Include:
 * 	  nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_AllOff();
 *  @endcode
 *
 */
void LCD_AllOff(void)
{
	LCD->MEM_0 = 0x00000000;
  	LCD->MEM_1 = 0x00000000;
  	LCD->MEM_2 = 0x00000000;
  	LCD->MEM_3 = 0x00000000;
	LCD->MEM_4 = 0x00000000;
	LCD->MEM_5 = 0x00000000;
	LCD->MEM_6 = 0x00000000;
	LCD->MEM_7 = 0x00000000;
	LCD->MEM_8 = 0x00000000;
	LCD->MEM_9 = 0x00000000;
}

/**
 *  @brief LCD Enable all segments
 *
 *  @param None
 *
 *  @par Include:
 * 	  nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_AllOn();
 *  @endcode
 *
 */
void LCD_AllOn(void)
{
  	LCD->MEM_0 = 0xffffffff;
  	LCD->MEM_1 = 0xffffffff;
  	LCD->MEM_2 = 0xffffffff;
  	LCD->MEM_3 = 0xffffffff;	
	LCD->MEM_4 = 0xffffffff;
	LCD->MEM_5 = 0xffffffff;
	LCD->MEM_6 = 0xffffffff;
	LCD->MEM_7 = 0xffffffff;
#ifdef LCD_LQFP100_PIN	
	LCD->MEM_8 = 0xffffffff;
	LCD->MEM_9 = 0xffffffff;
#endif	
}

/**
 *  @brief LCD Light up or shut off various symbols on LCD Display
 *
 *  @param[in] s   Which symbol to turn on or off
 *  @param[in] on  Zero is off, non-zero is on
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  // show the symbol 3 on LCD
 *  LCD_Symbol(3, 1);
 *  @endcode
 *
 */
void LCD_Symbol(E_LCDSYMBOL s, int on)
{
	int com = 0;
	int bit = 0;

