xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_lcd.c
	com = S_LCDSYMBOL[s].com;
	bit = S_LCDSYMBOL[s].seg;
	
  	if (on)
  	{
    	LCD_EnableSegment(com, bit);
  	}
  	else
  	{		
	    LCD_DisableSegment(com, bit);
  	}
}

/**
 *  @brief Update Charge Pump frequency according to register settings
 *
 *  @param None
 *
 *  @par Include:
 * 	  nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_UpdateChargePumpFreq();
 *  @endcode
 *
 */
void LCD_UpdateChargePumpFreq(void)
{
	uint32_t clkdiv;
	uint32_t cpump_freq_div[] = {1, 2, 4, 8, 16, 32, 64, 128};

	if((CLK->CLKSEL1 & CLK_CLKSEL1_LCD_MASK) == 0)
		g_LCDClkSrc = 32 * 1024;
	else
		g_LCDClkSrc = 10 * 1024;
	
	//clkdiv = LCD->DISPCTL_BITS.CPUMP_FREQ;
	clkdiv = (LCD->DISPCTL & LCD_DISPCTL_CPUMP_FREQ) >> 11;

	g_ChargePumpFreq = g_LCDClkSrc / cpump_freq_div[clkdiv];
	
	LCDDEBUG("Charge Pump Frequency = %f Hz \n", g_ChargePumpFreq);
}

/**
 *  @brief LCD voltage use internal charge pump
 *
 *  @param[in] lcdinit   Pointer to initial structure
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  S_LCD_INIT lcdinit;
 *  //LCD Initialize
 *  lcdinit.cpump_enable = true;
 *  lcdinit.internal_bias = true;
 *  lcdinit.cpump_freqdiv = LCD_CPUMP_DIV64;
 *  lcdinit.cpump_voltage = LCD_CPVOl_3_3V;
 *  lcdinit.bias = LCD_BIAS_THIRD;
 *  lcdinit.mux = LCD_MUX_QUADRUPLEX;
 *  lcdinit.freqdiv = LCD_FREQ_DIV64;
 *  DrvLCD_Init(&lcdinit);
 *  DrvLCD_ChargePumpInit(&lcdinit);
 *  @endcode
 *
 */
void LCD_ChargePumpInit(S_LCD_INIT *lcdinit)
{

  	if (lcdinit->cpump_enable==false)
  	{
		/* disable charge pump */
		LCD->DISPCTL &= ~LCD_DISPCTL_CPUMP_EN;		// Disable charge pump	
		return ;
  	}

	LCD->DISPCTL &= ~LCD_DISPCTL_BV_SEL;		// internal source for charge pump
    LCD->DISPCTL = LCD->DISPCTL & ~LCD_DISPCTL_CPUMP_FREQ | lcdinit->cpump_freqdiv;
    LCD->DISPCTL = LCD->DISPCTL & ~LCD_DISPCTL_CPUMP_VOL_SET | lcdinit->cpump_voltage;
	LCD->DISPCTL &= ~LCD_DISPCTL_IBRL_EN;
	LCD->DISPCTL |= (lcdinit->internal_bias==true)?LCD_DISPCTL_IBRL_EN:0;
	LCD->DISPCTL |= LCD_DISPCTL_CPUMP_EN;		// enable charge pump

	/* record the frequency in charge pump */
	LCD_UpdateChargePumpFreq();
 
}

/**
 *  @brief Enable frame count and frame count interrupt
 *
 *  @param[in] prediv   \n
 *                      Set to pre-scale divider for frame count \n
 *                      LCD_FCPRESC_DIV1: The frame-rate is divided by one \n
 *                      LCD_FCPRESC_DIV2: The frame-rate is divided by two \n
 *                      LCD_FCPRESC_DIV4: The frame-rate is divided by four \n
 *                      LCD_FCPRESC_DIV8: The frame-rate is divided by eight 
 *
 *  @param[in] fcv      Set to frame count top value
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_FrameCountEnable( LCD_FCPRESC_DIV2, 20 );
 *  @endcode
 *
 */
void LCD_FrameCountEnable( uint32_t prediv, uint32_t fcv )
{
	uint32_t div = 1; 	// default prediv == LCD_FCPRESC_DIV1

	LCD_UpdateLCDFrameFreq();
	
	LCD->FCR = 0x00;
	LCD->FCSTS |= LCD_FCSTS_FCSTS;	// clear fcsts flag

	if(prediv) {
		if(prediv>LCD_FCPRESC_DIV8) {
			LCDDEBUG("LCD frame count prescalar value use dividing by 8 \n");
			prediv = LCD_FCPRESC_DIV8;
		}
		LCD->FCR = LCD->FCR & ~LCD_FCR_PRESCL | prediv;
		if(prediv==LCD_FCPRESC_DIV1) div = 1;
		if(prediv==LCD_FCPRESC_DIV2) div = 2;
		if(prediv==LCD_FCPRESC_DIV4) div = 4;
		if(prediv==LCD_FCPRESC_DIV8) div = 8;
	}

	if(fcv)
	{
		if(fcv > 0x3F) {	// top value max. 63 = 0x3F
			LCDDEBUG("LCD frame counter top value is too big, so use max. value 63 \n");
			fcv = 0x3F;
		}
		LCD->FCR = LCD->FCR & ~LCD_FCR_FCV | (fcv << LCD_FCR_FCV_BIT_ADDR);
	}

	/* calculate frame count & INT frequency */
	g_LCDFrameCountFreq = g_LCDFrameRate / div;
	
	g_LCDFrameCountINTFreq = g_LCDFrameCountFreq / (fcv+1);

	LCDDEBUG("Frame-rate is %f Hz \n", g_LCDFrameRate);
	LCDDEBUG("FCV:%d, Interrupt frequency %f Hz, period time %f sec	\n", fcv, g_LCDFrameCountINTFreq, 1/g_LCDFrameCountINTFreq);
	
	LCD->FCR |= LCD_FCR_FCEN;		// enable LCD frame count
	
}

/**
 *  @brief Disable frame count function
 *
 *  @param None
 *
 *  @par Include:
 * 	  nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_FrameCountDisable( );
 *  @endcode
 *
 */
void LCD_FrameCountDisable(void)
{
	LCD->FCR = 0x00;		// disable LCD frame count

	if( LCD->FCSTS & LCD_FCSTS_FCSTS) 	// clear status flag
		LCD->FCSTS |= LCD_FCSTS_FCSTS;
}

/**
 *  @brief Update LCD clock frequency according to register settings
 *
 *  @param None
 *
 *  @par Include:
 * 	  nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_UpdateLCDFrameFreq( );
 *  @endcode
 *
 */
void LCD_UpdateLCDFrameFreq(void)
{
	uint32_t clkdiv, muldiv;
	uint32_t lcd_freq_div[] = {32, 64, 96, 128, 192, 256, 384, 512};
	uint32_t multiplex_freq_div[] = {2, 4, 6, 8, 10, 12};

	if((CLK->CLKSEL1 & CLK_CLKSEL1_LCD_MASK) == 0)
		g_LCDClkSrc = 32 * 1024;
	else
		g_LCDClkSrc = 10 * 1024;

	clkdiv = (LCD->CTL & LCD_CTL_FREQ) >> LCD_CTL_FREQ_BIT_ADDR;
	muldiv = (LCD->CTL & LCD_CTL_MUX) >> LCD_CTL_MUX_BIT_ADDR;

	g_LCDFreq = (double)g_LCDClkSrc / lcd_freq_div[clkdiv];
	LCDDEBUG("\n\ng_LCDFreq = %f Hz	\n", g_LCDFreq);
    g_LCDFrameRate = (double)g_LCDFreq / multiplex_freq_div[muldiv];
    LCDDEBUG("g_LCDFrameRate = %f Hz \n", g_LCDFrameRate);
    
}

/**
 *  @brief Switch LCD Segment Pin for enable/disable
 *
 *  @param[in] pinno   \n
 *                      Segment pin number \n
 *                      LQFP100_PIN: Segment pin from 0 ~ 39 \n
 *                      LQFP64_PIN : Segment pin from 0 ~ 31 
 *
 *  @param[in] enable   ENABLE/DISABLE LCD Segment Pin
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  // Disable LCD Segment 5
 *  LCD_SegmentPinEnable(5, DISABLE);
 *  @endcode
 *
 */
void LCD_SegmentPinEnable(uint32_t pinno, bool enable)
{

