xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_lcd.c
#ifdef LCD_LQFP100_PIN
	//uint32_t bitset;
	//if(enable == true) bitset = 7;
	//else bitset = 0;

	if (pinno == 0) {
		// Seg 0
		GCR->PD_H_MFP &= ~PD15_MFP_MASK;
		GCR->PD_H_MFP |= (enable == true) ? PD15_MFP_LCD_S0:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_15) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_15);
	} else if (pinno == 1) {
		// Seg 1
  		GCR->PD_H_MFP &= ~PD14_MFP_MASK;
		GCR->PD_H_MFP |= (enable == true) ? PD14_MFP_LCD_S1:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_14) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_14);
	} else if (pinno == 2) {
		// Seg 2
  		GCR->PD_L_MFP &= ~PD7_MFP_MASK;
		GCR->PD_L_MFP |= (enable == true) ? PD7_MFP_LCD_S2:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_7) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_7);
	} else if (pinno == 3) {
		// Seg 3
  		GCR->PD_L_MFP &= ~PD6_MFP_MASK;
		GCR->PD_L_MFP |= (enable == true) ? PD6_MFP_LCD_S3:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_6) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_6);
	} else if (pinno == 4) {
		// Seg 4
  		GCR->PB_L_MFP &= ~PB3_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB3_MFP_LCD_S4:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_3) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_3);
	} else if (pinno == 5) {
		// Seg 5
		GCR->PB_L_MFP &= ~PB2_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB2_MFP_LCD_S5:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_2) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_2);
	} else if (pinno == 6) {
		// Seg 6
		GCR->PB_L_MFP &= ~PB1_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB1_MFP_LCD_S6:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_1) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_1);
	} else if (pinno == 7) {
		// Seg 7
		GCR->PB_L_MFP &= ~PB0_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB0_MFP_LCD_S7:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_0) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_0);
	} else if (pinno == 8) {
		// Seg 8
		GCR->PE_L_MFP &= ~PE7_MFP_MASK;
		GCR->PE_L_MFP |= (enable == true) ? PE7_MFP_LCD_S8:0;
		GPIOE->OFFD = (enable == true)? (GPIOE->OFFD | GPIO_OFFD_OFFD_7) : (GPIOE->OFFD &~GPIO_OFFD_OFFD_7);
	} else if (pinno == 9) {
		// Seg 9
		GCR->PE_H_MFP &= ~PE8_MFP_MASK;
		GCR->PE_H_MFP |= (enable == true) ? PE8_MFP_LCD_S9:0;
		GPIOE->OFFD = (enable == true)? (GPIOE->OFFD | GPIO_OFFD_OFFD_8) : (GPIOE->OFFD &~GPIO_OFFD_OFFD_8);
	} else if (pinno == 10) {
		// Seg 10
		GCR->PB_L_MFP &= ~PB7_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB7_MFP_LCD_S10:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_7) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_7);
	} else if (pinno == 11) {
		// Seg 11
		GCR->PB_L_MFP &= ~PB6_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB6_MFP_LCD_S11:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_6) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_6);
	} else if (pinno == 12) {
		// Seg 12
		GCR->PB_L_MFP &= ~PB5_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB5_MFP_LCD_S12:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_5) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_5);
	} else if (pinno == 13) {
		// Seg 13
		GCR->PB_L_MFP &= ~PB4_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB4_MFP_LCD_S13:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_4) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_4);
	} else if (pinno == 14) {
		// Seg 14
		GCR->PD_H_MFP &= ~PD13_MFP_MASK;
		GCR->PD_H_MFP |= (enable == true) ? PD13_MFP_LCD_S14:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_13) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_13);
	} else if (pinno == 15) {
		// Seg 15
		GCR->PD_H_MFP &= ~PD12_MFP_MASK;
		GCR->PD_H_MFP |= (enable == true) ? PD12_MFP_LCD_S15:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_12) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_12);
	} else if (pinno == 16) {
		// Seg 16
		GCR->PD_H_MFP &= ~PD11_MFP_MASK;
		GCR->PD_H_MFP |= (enable == true) ? PD11_MFP_LCD_S16:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_11) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_11);
	} else if (pinno == 17) {
		// Seg 17
		GCR->PD_H_MFP &= ~PD10_MFP_MASK;
		GCR->PD_H_MFP |= (enable == true) ? PD10_MFP_LCD_S17:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_10) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_10);
	} else if (pinno == 18) {
		// Seg 18
		GCR->PD_H_MFP &= ~PD9_MFP_MASK;
		GCR->PD_H_MFP |= (enable == true) ? PD9_MFP_LCD_S18:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_9) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_9);
	} else if (pinno == 19) {
		// Seg 19
		GCR->PD_H_MFP &= ~PD8_MFP_MASK;
		GCR->PD_H_MFP |= (enable == true) ? PD8_MFP_LCD_S19:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_8) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_8);
	} else if (pinno == 20) {
		// Seg 20
		GCR->PA_H_MFP &= ~PA8_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA8_MFP_LCD_S20:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_8) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_8);
	} else if (pinno == 21) {
		// Seg 21
		GCR->PA_H_MFP &= ~PA9_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA9_MFP_LCD_S21:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_9) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_9);
	} else if (pinno == 22) {
		// Seg 22
		GCR->PA_H_MFP &= ~PA10_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA10_MFP_LCD_S22:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_10) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_10);
	} else if (pinno == 23) {
		// Seg 23
		GCR->PA_H_MFP &= ~PA11_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA11_MFP_LCD_S23:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_11) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_11);
	} else if (pinno == 24) {
		// Seg 24
		GCR->PB_H_MFP &= ~PB12_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB12_MFP_LCD_S24:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_12) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_12);
	} else if (pinno == 25) {
		// Seg 25
		GCR->PB_H_MFP &= ~PB13_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB13_MFP_LCD_S25:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_13) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_13);
	} else if (pinno == 26) {
		// Seg 26
		GCR->PB_H_MFP &= ~PB14_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB14_MFP_LCD_S26:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_14) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_14);
	} else if (pinno == 27) {
		// Seg 27
		GCR->PE_H_MFP &= ~PE13_MFP_MASK;
		GCR->PE_H_MFP |= (enable == true) ? PE13_MFP_LCD_S27:0;
		GPIOE->OFFD = (enable == true)? (GPIOE->OFFD | GPIO_OFFD_OFFD_13) : (GPIOE->OFFD &~GPIO_OFFD_OFFD_13);
	} else if (pinno == 28) {
		// Seg 28
		GCR->PE_H_MFP &= ~PE14_MFP_MASK;
		GCR->PE_H_MFP |= (enable == true) ? PE14_MFP_LCD_S28:0;
		GPIOE->OFFD = (enable == true)? (GPIOE->OFFD | GPIO_OFFD_OFFD_14) : (GPIOE->OFFD &~GPIO_OFFD_OFFD_14);
	} else if (pinno == 29) {
		// Seg 29
		GCR->PE_H_MFP &= ~PE15_MFP_MASK;
		GCR->PE_H_MFP |= (enable == true) ? PE15_MFP_LCD_S29:0;
		GPIOE->OFFD = (enable == true)? (GPIOE->OFFD | GPIO_OFFD_OFFD_15) : (GPIOE->OFFD &~GPIO_OFFD_OFFD_15);
	} else if (pinno == 30) {
		// Seg 30
		GCR->PB_H_MFP &= ~PB8_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB8_MFP_LCD_S30:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_8) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_8);
	} else if (pinno == 31) {
		// Seg 31
		GCR->PB_H_MFP &= ~PB15_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB15_MFP_LCD_S31:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_15) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_15);
	} else if (pinno == 32) {
		// Seg 32
		GCR->PC_H_MFP &= ~PC14_MFP_MASK;
		GCR->PC_H_MFP |= (enable == true) ? PC14_MFP_LCD_S32:0;
		GPIOC->OFFD = (enable == true)? (GPIOC->OFFD | GPIO_OFFD_OFFD_14) : (GPIOC->OFFD &~GPIO_OFFD_OFFD_14);
	} else if (pinno == 33) {
		// Seg 33
		GCR->PC_H_MFP &= ~PC15_MFP_MASK;
		GCR->PC_H_MFP |= (enable == true) ? PC15_MFP_LCD_S33:0;
		GPIOC->OFFD = (enable == true)? (GPIOC->OFFD | GPIO_OFFD_OFFD_15) : (GPIOC->OFFD &~GPIO_OFFD_OFFD_15);
	} else if (pinno == 34) {
		// Seg 34
		GCR->PD_L_MFP &= ~PD5_MFP_MASK;
		GCR->PD_L_MFP |= (enable == true) ? PD5_MFP_LCD_S34:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_5) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_5);
	} else if (pinno == 35) {
		// Seg 35
		GCR->PD_L_MFP &= ~PD4_MFP_MASK;
		GCR->PD_L_MFP |= (enable == true) ? PD4_MFP_LCD_S35:0;
		GPIOD->OFFD = (enable == true)? (GPIOD->OFFD | GPIO_OFFD_OFFD_4) : (GPIOD->OFFD &~GPIO_OFFD_OFFD_4);
	} else if (pinno == 36) {
		// Seg 36
		GCR->PA_L_MFP &= ~PA7_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA7_MFP_LCD_S36:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_7) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_7);
	} else if (pinno == 37) {
		// Seg 37
		GCR->PA_L_MFP &= ~PA6_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA6_MFP_LCD_S37:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_6) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_6);
	} else if (pinno == 38) {
		// Seg 38
		GCR->PA_L_MFP &= ~PA5_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA5_MFP_LCD_S38:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_5) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_5);
	} else if (pinno == 39) {
		// Seg 39
		GCR->PA_L_MFP &= ~PA4_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA4_MFP_LCD_S39:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_4) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_4);
	}
#endif

