xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_lcd.c
#ifdef LCD_LQFP64_PIN
	uint32_t bitset;
	if(enable == true) bitset = 7;
	else bitset = 0;

	if (pinno == 0) {
		// Seg 0
		GCR->PB_L_MFP &= ~PB1_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB1_MFP_LCD_S0:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_1) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_1);
	} else if (pinno == 1) {
		// Seg 1
		GCR->PB_L_MFP &= ~PB0_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB0_MFP_LCD_S1:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_0) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_0);
	} else if (pinno == 2) {
		// Seg 2
		GCR->PB_L_MFP &= ~PB7_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB7_MFP_LCD_S2:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_7) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_7);
	} else if (pinno == 3) {
		// Seg 3
		GCR->PB_L_MFP &= ~PB6_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB6_MFP_LCD_S3:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_6) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_6);
	} else if (pinno == 4) {
		// Seg 4
		GCR->PB_L_MFP &= ~PB5_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB5_MFP_LCD_S4:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_5) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_5);
	} else if (pinno == 5) {
		// Seg 5
		GCR->PB_L_MFP &= ~PB4_MFP_MASK;
		GCR->PB_L_MFP |= (enable == true) ? PB4_MFP_LCD_S5:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_4) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_4);
	} else if (pinno == 6) {
		// Seg 6
		GCR->PA_H_MFP &= ~PA8_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA8_MFP_LCD_S6:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_8) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_8);
	} else if (pinno == 7) {
		// Seg 7
		GCR->PA_H_MFP &= ~PA9_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA9_MFP_LCD_S7:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_9) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_9);
	} else if (pinno == 8) {
		// Seg 8
		GCR->PA_H_MFP &= ~PA10_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA10_MFP_LCD_S8:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_10) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_10);
	} else if (pinno == 9) {
		// Seg 9
		GCR->PA_H_MFP &= ~PA11_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA11_MFP_LCD_S9:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_11) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_11);
	} else if (pinno == 10) {
		// Seg 10
		GCR->PB_H_MFP &= ~PB12_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB12_MFP_LCD_S10:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_12) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_12);
	} else if (pinno == 11) {
		// Seg 11
		GCR->PB_H_MFP &= ~PB13_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB13_MFP_LCD_S11:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_13) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_13);
	} else if (pinno == 12) {
		// Seg 12
		GCR->PB_H_MFP &= ~PB14_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB14_MFP_LCD_S12:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_14) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_14);
	} else if (pinno == 13) {
		// Seg 13
		GCR->PB_H_MFP &= ~PB8_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB8_MFP_LCD_S13:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_8) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_8);
	} else if (pinno == 14) {
		// Seg 14
		GCR->PB_H_MFP &= ~PB15_MFP_MASK;
		GCR->PB_H_MFP |= (enable == true) ? PB15_MFP_LCD_S14:0;
		GPIOB->OFFD = (enable == true)? (GPIOB->OFFD | GPIO_OFFD_OFFD_15) : (GPIOB->OFFD &~GPIO_OFFD_OFFD_15);
	} else if (pinno == 15) {
		// Seg 15
		GCR->PC_H_MFP &= ~PC14_MFP_MASK;
		GCR->PC_H_MFP |= (enable == true) ? PC14_MFP_LCD_S15:0;
		GPIOC->OFFD = (enable == true)? (GPIOC->OFFD | GPIO_OFFD_OFFD_14) : (GPIOC->OFFD &~GPIO_OFFD_OFFD_14);
	} else if (pinno == 16) {
		// Seg 16
		GCR->PC_H_MFP &= ~PC15_MFP_MASK;
		GCR->PC_H_MFP |= (enable == true) ? PC15_MFP_LCD_S16:0;
		GPIOC->OFFD = (enable == true)? (GPIOC->OFFD | GPIO_OFFD_OFFD_15) : (GPIOC->OFFD &~GPIO_OFFD_OFFD_15);
	} else if (pinno == 17) {
		// Seg 17
		GCR->PC_L_MFP &= ~PC7_MFP_MASK;
		GCR->PC_L_MFP |= (enable == true) ? PC7_MFP_LCD_S17:0;
		GPIOC->OFFD = (enable == true)? (GPIOC->OFFD | GPIO_OFFD_OFFD_7) : (GPIOC->OFFD &~GPIO_OFFD_OFFD_7);
	} else if (pinno == 18) {
		// Seg 18
		GCR->PA_L_MFP &= ~PA7_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA7_MFP_LCD_S18:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_7) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_7);
	} else if (pinno == 19) {
		// Seg 19
		GCR->PA_L_MFP &= ~PA6_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA6_MFP_LCD_S19:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_6) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_6);
	} else if (pinno == 20) {
		// Seg 20
		GCR->PA_L_MFP &= ~PA5_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA5_MFP_LCD_S20:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_5) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_5);
	} else if (pinno == 21) {
		// Seg 21
		GCR->PA_L_MFP &= ~PA4_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA4_MFP_LCD_S21:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_4) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_4);
	} else if (pinno == 22) {
		// Seg 22
		GCR->PA_L_MFP &= ~PA3_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA3_MFP_LCD_S22:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_3) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_3);
	} else if (pinno == 23) {
		// Seg 23
		GCR->PA_L_MFP &= ~PA2_MFP_MASK;
		GCR->PA_L_MFP |= (enable == true) ? PA2_MFP_LCD_S23:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_2) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_2);
	} else if (pinno == 24) {
		// Seg 24
		GCR->PA_H_MFP &= ~PA12_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA12_MFP_LCD_S24:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_12) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_12);
	} else if (pinno == 25) {
		// Seg 25
		GCR->PA_H_MFP &= ~PA13_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA13_MFP_LCD_S25:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_13) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_13);
	} else if (pinno == 26) {
		// Seg 26
		GCR->PA_H_MFP &= ~PA14_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA14_MFP_LCD_S26:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_14) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_14);
	} else if (pinno == 27) {
		// Seg 27
		GCR->PA_H_MFP &= ~PA15_MFP_MASK;
		GCR->PA_H_MFP |= (enable == true) ? PA15_MFP_LCD_S27:0;
		GPIOA->OFFD = (enable == true)? (GPIOA->OFFD | GPIO_OFFD_OFFD_15) : (GPIOA->OFFD &~GPIO_OFFD_OFFD_15);
	} else if (pinno == 28) {
		// Seg 28
		GCR->PC_H_MFP &= ~PC8_MFP_MASK;
		GCR->PC_H_MFP |= (enable == true) ? PC8_MFP_LCD_S28:0;
		GPIOC->OFFD = (enable == true)? (GPIOC->OFFD | GPIO_OFFD_OFFD_8) : (GPIOC->OFFD &~GPIO_OFFD_OFFD_8);
	} else if (pinno == 29) {
		// Seg 29
		GCR->PC_H_MFP &= ~PC9_MFP_MASK;
		GCR->PC_H_MFP |= (enable == true) ? PC9_MFP_LCD_S29:0;
		GPIOC->OFFD = (enable == true)? (GPIOC->OFFD | GPIO_OFFD_OFFD_9) : (GPIOC->OFFD &~GPIO_OFFD_OFFD_9);
	} else if (pinno == 30) {
		// Seg 30
		GCR->PC_H_MFP &= ~PC10_MFP_MASK;
		GCR->PC_H_MFP |= (enable == true) ? PC10_MFP_LCD_S30:0;
		GPIOC->OFFD = (enable == true)? (GPIOC->OFFD | GPIO_OFFD_OFFD_10) : (GPIOC->OFFD &~GPIO_OFFD_OFFD_10);
	} else if (pinno == 31) {
		// Seg 31
		GCR->PC_H_MFP &= ~PC11_MFP_MASK;
		GCR->PC_H_MFP |= (enable == true) ? PC11_MFP_LCD_S31:0;
		GPIOC->OFFD = (enable == true)? (GPIOC->OFFD | GPIO_OFFD_OFFD_11) : (GPIOC->OFFD &~GPIO_OFFD_OFFD_11);
	}

#endif

