xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_lcd.c
}

/**
 *  @brief Switch pin function for LCD
 *
 *  @param None
 *
 *  @par Include:
 * 	  nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_PinSwitch_Set();
 *  @endcode
 *
 */
void LCD_PinSwitch_Set(void)
{

#ifdef LCD_LQFP100_PIN
	/* switch multi-function pin to LCD for LQFP-100 */
	// SEG39
	GCR->PA_L_MFP |= PA4_MFP_LCD_S39;
	// SEG38
	GCR->PA_L_MFP |= PA5_MFP_LCD_S38;
	// SEG37
	GCR->PA_L_MFP |= PA6_MFP_LCD_S37;
	// SEG36
	GCR->PA_L_MFP |= PA7_MFP_LCD_S36;
	// SEG20
	GCR->PA_H_MFP |= PA8_MFP_LCD_S20;
	// SEG21
	GCR->PA_H_MFP |= PA9_MFP_LCD_S21;
	// SEG22
	GCR->PA_H_MFP |= PA10_MFP_LCD_S22;
	// SEG23
	GCR->PA_H_MFP |= PA11_MFP_LCD_S23;
	
	// SEG7
	GCR->PB_L_MFP |= PB0_MFP_LCD_S7;
	// SEG6
	GCR->PB_L_MFP |= PB1_MFP_LCD_S6;
	// SEG5
	GCR->PB_L_MFP |= PB2_MFP_LCD_S5;
	// SEG4
	GCR->PB_L_MFP |= PB3_MFP_LCD_S4;
	// SEG13
	GCR->PB_L_MFP |= PB4_MFP_LCD_S13;
	// SEG12
	GCR->PB_L_MFP |= PB5_MFP_LCD_S12;
	// SEG11
	GCR->PB_L_MFP |= PB6_MFP_LCD_S11;
	// SEG10
	GCR->PB_L_MFP |= PB7_MFP_LCD_S10;
	// SEG30
	GCR->PB_H_MFP |= PB8_MFP_LCD_S30;
	// V1
	GCR->PB_H_MFP |= PB9_MFP_LCD_V1;
	// V2
	GCR->PB_H_MFP |= PB10_MFP_LCD_V2;
	// V3
	GCR->PB_H_MFP |= PB11_MFP_LCD_V3;
	// SEG24
	GCR->PB_H_MFP |= PB12_MFP_LCD_S24;
	// SEG25
	GCR->PB_H_MFP |= PB13_MFP_LCD_S25;
	// SEG26
	GCR->PB_H_MFP |= PB14_MFP_LCD_S26;
	// SEG31
	GCR->PB_H_MFP |= PB15_MFP_LCD_S31;
	
	// DH1
	GCR->PC_L_MFP |= PC0_MFP_LCD_DH1;
	// DH2
	GCR->PC_L_MFP |= PC1_MFP_LCD_DH2;
	// COM0
	GCR->PC_L_MFP |= PC2_MFP_LCD_COM0;
	// COM1
	GCR->PC_L_MFP |= PC3_MFP_LCD_COM1;
	// COM2
	GCR->PC_L_MFP |= PC4_MFP_LCD_COM2;
	// COM3
	GCR->PC_L_MFP |= PC5_MFP_LCD_COM3;
	// SEG32
	GCR->PC_H_MFP |= PC14_MFP_LCD_S32;
	// SEG33
	GCR->PC_H_MFP |= PC15_MFP_LCD_S33;

	// SEG35
	GCR->PD_L_MFP |= PD4_MFP_LCD_S35;
	// SEG34
	GCR->PD_L_MFP |= PD5_MFP_LCD_S34;
	// SEG3
	GCR->PD_L_MFP |= PD6_MFP_LCD_S3;
	// SEG2
	GCR->PD_L_MFP |= PD7_MFP_LCD_S2;
	// SEG19
	GCR->PD_H_MFP |= PD8_MFP_LCD_S19;
	// SEG18
	GCR->PD_H_MFP |= PD9_MFP_LCD_S18;
	// SEG17
	GCR->PD_H_MFP |= PD10_MFP_LCD_S17;
	// SEG16
	GCR->PD_H_MFP |= PD11_MFP_LCD_S16;
	// SEG15
	GCR->PD_H_MFP |= PD12_MFP_LCD_S15;
	// SEG14
	GCR->PD_H_MFP |= PD13_MFP_LCD_S14;
	// SEG1
	GCR->PD_H_MFP |= PD14_MFP_LCD_S1;
	// SEG0
	GCR->PD_H_MFP |= PD15_MFP_LCD_S0;

	// SEG8
	GCR->PE_L_MFP |= PE7_MFP_LCD_S8;
	// SEG9
	GCR->PE_H_MFP |= PE8_MFP_LCD_S9;
	// SEG27
	GCR->PE_H_MFP |= PE13_MFP_LCD_S27;
	// SEG28
	GCR->PE_H_MFP |= PE14_MFP_LCD_S28;
	// SEG29
	GCR->PE_H_MFP |= PE15_MFP_LCD_S29;
#endif

#ifdef LCD_LQFP64_PIN
	/* switch multi-function pin to LCD for LQFP-64 */
	// SEG23
	GCR->PA_L_MFP |= PA2_MFP_LCD_S23;
	// SEG22
	GCR->PA_L_MFP |= PA3_MFP_LCD_S22;
	// SEG21
	GCR->PA_L_MFP |= PA4_MFP_LCD_S21;
	// SEG20
	GCR->PA_L_MFP |= PA5_MFP_LCD_S20;
	// SEG19
	GCR->PA_L_MFP |= PA6_MFP_LCD_S19;
	// SEG18
	GCR->PA_L_MFP |= PA7_MFP_LCD_S18;
	// SEG6
	GCR->PA_H_MFP |= PA8_MFP_LCD_S6;
	// SEG7
	GCR->PA_H_MFP |= PA9_MFP_LCD_S7;
	// SEG8
	GCR->PA_H_MFP |= PA10_MFP_LCD_S8;
	// SEG9
	GCR->PA_H_MFP |= PA11_MFP_LCD_S9;
	// SEG24
	GCR->PA_H_MFP |= PA12_MFP_LCD_S24;
	// SEG25
	GCR->PA_H_MFP |= PA13_MFP_LCD_S25;
	// SEG26
	GCR->PA_H_MFP |= PA14_MFP_LCD_S26;
	// SEG27
	GCR->PA_H_MFP |= PA15_MFP_LCD_S27;
	// SEG1
	GCR->PB_L_MFP |= PB0_MFP_LCD_S1;
	// SEG0
	GCR->PB_L_MFP |= PB1_MFP_LCD_S0;
	// COM3
	GCR->PB_L_MFP |= PB2_MFP_LCD_COM3;
	// COM2
	GCR->PB_L_MFP |= PB3_MFP_LCD_COM2;
	// SEG5
	GCR->PB_L_MFP |= PB4_MFP_LCD_S5;
	// SEG4
	GCR->PB_L_MFP |= PB5_MFP_LCD_S4;
	// SEG3
	GCR->PB_L_MFP |= PB6_MFP_LCD_S3;
	// SEG2
	GCR->PB_L_MFP |= PB7_MFP_LCD_S2;
	// SEG13
	GCR->PB_H_MFP |= PB8_MFP_LCD_S13;

	// V1
	GCR->PB_H_MFP |= PB9_MFP_LCD_V1;
	// V2
	GCR->PB_H_MFP |= PB10_MFP_LCD_V2;
	// V3
	GCR->PB_H_MFP |= PB11_MFP_LCD_V3;

	// SEG10
	GCR->PB_H_MFP |= PB12_MFP_LCD_S10;
	// SEG11
	GCR->PB_H_MFP |= PB13_MFP_LCD_S11;
	// SEG12
	GCR->PB_H_MFP |= PB14_MFP_LCD_S12;
	// SEG14
	GCR->PB_H_MFP |= PB15_MFP_LCD_S14;

	// DH1
	GCR->PC_L_MFP |= PC0_MFP_LCD_DH1;
	// DH2
	GCR->PC_L_MFP |= PC1_MFP_LCD_DH2;
	// COM0
	GCR->PC_L_MFP |= PC2_MFP_LCD_COM0;
	// COM1
	GCR->PC_L_MFP |= PC3_MFP_LCD_COM1;
	
	// SEG17
	GCR->PC_L_MFP |= PC7_MFP_LCD_S17;

	// SEG28
	GCR->PC_H_MFP |= PC8_MFP_LCD_S28;
	// SEG29
	GCR->PC_H_MFP |= PC9_MFP_LCD_S29;
	// SEG30
	GCR->PC_H_MFP |= PC10_MFP_LCD_S30;
	// SEG31
	GCR->PC_H_MFP |= PC11_MFP_LCD_S31;

	// SEG15
	GCR->PC_H_MFP |= PC14_MFP_LCD_S15;
	// SEG16
	GCR->PC_H_MFP |= PC15_MFP_LCD_S16;
#endif


}

/**
 *  @brief LCD Initialization routine for NANO100 display
 *
 *  @param[in] lcdinit  \n
 *                      S_LCD_INIT is a data structure to store initial settings. \n
 *                      typedef struct                                            \n
 *                      {                                                         \n
 *                          bool cpump_enable;     // Specifies if enable charge pump or not \n
 *                          bool internal_bias;    // Specifies if enable internal bias reference ladder or not \n
 *                          E_LCD_MUX mux; 	    // Specifies Mux configuration \n 
 *                          E_LCD_BIAS bias;	    // Specifies Bias configuration \n 
 *                          E_LCD_FREQDIV freqdiv; // Specifies LCD Frequency Divider Selection \n   
 *                          E_LCD_CPUMP_FREQDIV cpump_freqdiv; // Specifies frequency divider of charge pump \n
 *                          E_LCD_CPUMP_VOL cpump_voltage; // Specifies voltage of charge pump \n
 *                      } S_LCD_INIT;
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  S_LCD_INIT lcdinit;
 *  // LCD Initialize 
 *  lcdinit.cpump_enable = false;
 *  lcdinit.internal_bias = false;
 *  lcdinit.bias = LCD_BIAS_THIRD;
 *  lcdinit.mux = LCD_MUX_QUADRUPLEX;
 *  lcdinit.freqdiv = LCD_FREQ_DIV64;
 *  DrvLCD_Init(&lcdinit);
 *  @endcode
 *
 */
void LCD_Init(S_LCD_INIT *lcdinit)
{
  	/* Enable LCD Clock  */
	CLK->APBCLK |= CLK_APBCLK_LCD_EN; 

