xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_lcd.c
  	/* IP reset */
	GCR->IPRST_CTL2 |= GCR_IPRSTCTL2_LCD;
	GCR->IPRST_CTL2 &= ~GCR_IPRSTCTL2_LCD;

	LCD_Disable();

  	/* Turn all segments off */
  	LCD_AllOff();

	// V1
	GCR->PB_H_MFP |= PB9_MFP_LCD_V1;
	// V2
	GCR->PB_H_MFP |= PB10_MFP_LCD_V2;
	// V3
	GCR->PB_H_MFP |= PB11_MFP_LCD_V3;
	// DH1
	GCR->PC_L_MFP |= PC0_MFP_LCD_DH1;
	// DH2
	GCR->PC_L_MFP |= PC1_MFP_LCD_DH2;

	/* Digital Input Path Disable */
	/* V1, V2 and V3 */
	GPIOB->OFFD |= (0xE000000);
	/* DH1 and DH2 */
	GPIOC->OFFD |= (0x30000);

	/* voltage & bias generator settings */
	if(lcdinit->cpump_enable == true)
	{
		LCD_ChargePumpInit(lcdinit);
	} 
	else
	{
		LCD->DISPCTL &= ~LCD_DISPCTL_CPUMP_EN;
		LCD->DISPCTL |= LCD_DISPCTL_BV_SEL;
		LCD->DISPCTL &= ~LCD_DISPCTL_IBRL_EN;
		LCD->DISPCTL |= (lcdinit->internal_bias==true)?LCD_DISPCTL_IBRL_EN:0;	
	}
	
	/* Normal Settings */
	LCD->CTL = LCD->CTL & ~LCD_CTL_FREQ | lcdinit->freqdiv;	// LCD frequency div 512 default // 32768/512 = 64Hz
  	LCD->CTL = LCD->CTL & ~LCD_CTL_MUX | lcdinit->mux;
	LCD->DISPCTL = LCD->DISPCTL & ~LCD_DISPCTL_BIAS_SEL | lcdinit->bias; 

	LCD_Enable();	// Enable LCD

	LCD_UpdateLCDFrameFreq();
}

/**
 *  @brief The function is used to disable LCD controller, disable LCD clock and disable ISR 
 *
 *  @param None
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_DeInit( );
 *  @endcode
 *
 */
void LCD_DeInit(void)
{
	LCD_Disable();

	CLK->APBCLK &= ~CLK_APBCLK_LCD_EN;
	NVIC_DisableIRQ (LCD_IRQn);
}

/**
 *  @brief Set Blinking frequency in LCD controller
 *
 *  @param[in] mdelay   Blinking delay time (Uint: ms)
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return  0: Successful \n
 *           ERR_LCD_CAL_BLINK_FAIL: Can't calculate the appropriate hardware setting to apply the blinking frequency.
 *
 *  @par Example
 *  @code
 *  // the frequency of blinking is 2 times per second
 *  DrvLCD_BlinkFrequency(500);
 *  @endcode
 *
 */
int32_t LCD_BlinkFrequency(double mdelay)
{
	uint32_t prescale=LCD_FCPRESC_DIV1, div=1;
	uint32_t framecount;

	LCDDEBUG("In present, frame rate is %f Hz \n", g_LCDFrameRate);

	framecount = (uint32_t) (mdelay / ((1/g_LCDFrameRate)*1000)) ;

	if(framecount > 0x3F) 
	{
		for(div=2; div<=8; div*=2)
		{
			framecount = (uint32_t) (mdelay / ((1/(g_LCDFrameRate/div)*1000) ));
			if( framecount <= 0x40 )
				break;
		}
		if(div==2) prescale = LCD_FCPRESC_DIV2;
		else if(div==4) prescale = LCD_FCPRESC_DIV4;
		else if(div==8) prescale = LCD_FCPRESC_DIV8;
		else return ERR_LCD_CAL_BLINK_FAIL;
	} 
	else if(framecount == 0)
	{
		framecount = 1;
	}
	LCDDEBUG("Actual blinking frequency %f second(s) \n", (1/(g_LCDFrameRate/div))*(framecount) );
	LCDDEBUG("FCV=%d, PreScale divider=%d \n", framecount, div);

	LCD->FCR = LCD->FCR & ~LCD_FCR_PRESCL | prescale;
	LCD->FCR = LCD->FCR & ~LCD_FCR_FCV | ((framecount - 1) << LCD_FCR_FCV_BIT_ADDR);
	LCD->FCR |= LCD_FCR_FCEN;
	
	return 0;
}
 

/**
 *  @brief Disable Blink function in LCD controller
 *
 *  @param None
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code
 *  LCD_DisableBlink( );
 *  @endcode
 *
 */
void LCD_DisableBlink(void)
{
	/* Disable Blink LCD */
	LCD->CTL &= ~LCD_CTL_BLINK;
	/* Disable frame count */
	LCD_FrameCountDisable();
}

/**
 *  @brief This function is used to enable LCD interrupt
 *
 *  @param[in] IntSrc         Interrupt Source: LCD_FRAMECOUNT_INT / LCD_POWERDOWN_INT / LCD_ALL_INT
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code 
 *  LCD_EnableInt (LCD_FRAMECOUNT_INT);
 *  @endcode
 *
 */
void LCD_EnableInt(uint32_t IntSrc)
{
	switch (IntSrc)
    {
    	case LCD_FRAMECOUNT_INT:
        {
			LCD->FCR |= LCD_FCR_FCINTEN; 
   			break;
        }
        case LCD_POWERDOWN_INT:
        {
			LCD->CTL |= LCD_CTL_PDINT_EN; 
            break;
        }
    }
	NVIC_EnableIRQ(LCD_IRQn); 
}

/**
 *  @brief This function is used to disable LCD specified interrupt
 *
 *  @param[in] IntSrc   Interrupt Source: LCD_FRAMECOUNT_INT / LCD_POWERDOWN_INT / LCD_ALL_INT
 *
 *  @par Include:
 *    nano1xx_drivers/nano1xx_lcd.h
 *
 *  @return None
 *
 *  @par Example
 *  @code 
 *  LCD_DisableInt( LCD_POWERDOWN_INT );
 *  @endcode
 *
 */
void LCD_DisableInt(uint32_t IntSrc)
{
	
	if((IntSrc & LCD_FRAMECOUNT_INT) == LCD_FRAMECOUNT_INT )
	{
		LCD->FCR &= ~LCD_FCR_FCINTEN; 
		LCD->FCSTS |= LCD_FCSTS_FCSTS;
	}
	else if((IntSrc & LCD_POWERDOWN_INT) == LCD_POWERDOWN_INT )
	{
		LCD->CTL &= ~LCD_CTL_PDINT_EN; 
		LCD->FCSTS |= LCD_FCSTS_PDSTS; 
	}

}

/*@}*/ /* end of group NANO1xx_LCD_EXPORTED_FUNCTIONS */
 
/*@}*/ /* end of group NANO1xx_LCD_Driver */

/*@}*/ /* end of group NANO1xx_Device_Driver */

/*** (C) COPYRIGHT 2012 Nuvoton Technology Corp. ***/

